Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СформироватьСхемуКомпоновкиДанных(ДокументИлиОбъектМетаданных) Экспорт
	
	ОбъектМетаданных = Неопределено;
	ДокументСсылка = Неопределено;
	
	Если ТипЗнч(ДокументИлиОбъектМетаданных) <> Тип("ОбъектМетаданных") Тогда
		
		Если ТипЗнч(ДокументИлиОбъектМетаданных) = Тип("Строка") Тогда
			
			Если СтрНайти(ДокументИлиОбъектМетаданных, ".") > 0 Тогда
				ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ДокументИлиОбъектМетаданных);
			Иначе
				ОбъектМетаданных = Метаданные.Документы.Найти(ДокументИлиОбъектМетаданных);
			КонецЕсли;
			
		Иначе

			Если SUI_ОбщегоНазначения.ЭтоСсылкаДокумента(ДокументИлиОбъектМетаданных) И
				SUI_ОбщегоНазначения.СсылкаСуществует(ДокументИлиОбъектМетаданных) Тогда
				ДокументСсылка 		= ДокументИлиОбъектМетаданных;
				ОбъектМетаданных 	= ДокументИлиОбъектМетаданных.Метаданные();
			КонецЕсли;

		КонецЕсли;
		
	Иначе
		ОбъектМетаданных = ДокументИлиОбъектМетаданных;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектМетаданных) <> Тип("ОбъектМетаданных") Или
		Не Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СхемаДокумента = SUI_КомпоновкаДанныхСервер.ПустаяСхема();
	
	НаборДанных = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(СхемаДокумента, , "НаборДанныхДокумент");
	
	НаборДанных.Запрос = "ВЫБРАТЬ * ИЗ " + ОбъектМетаданных.ПолноеИмя() + " КАК ДанныеДокумента";
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		НаборДанных.Запрос = НаборДанных.Запрос + "
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &ДокументСсылка";
		
		SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(СхемаДокумента, "ДокументСсылка", , ДокументСсылка);
		
	КонецЕсли;
	
	Возврат СхемаДокумента;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	SUI_НастройкиДокументов.Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов.СоответствияРеквизитовТабличныхЧастей КАК
		|		SUI_НастройкиДокументовСоответствияРеквизитовТабличныхЧастей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|		ПО SUI_НастройкиДокументовСоответствияРеквизитовТабличныхЧастей.Ссылка = SUI_НастройкиДокументов.Ссылка
		|ГДЕ
		|	НЕ SUI_НастройкиДокументов.ПометкаУдаления
		|   И SUI_НастройкиДокументов.Используется";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление = СтрШаблон(НСтр("ru = '%1: %2'"), Метаданные.Справочники.SUI_НастройкиДокументов.Синоним, Данные.Наименование);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьДанныеДляВыгрузки(КоллекцияНастроек, КолонкаСсылки = "Ссылка", КолонкаДанных = "Данные") Экспорт
	
	КолонкаСсылкиДобавлена = Ложь;
	НайденнаяКолонка = КоллекцияНастроек.Колонки.Найти(КолонкаСсылки);
	Если НайденнаяКолонка = Неопределено Тогда
		КоллекцияНастроек.Колонки.Добавить(КолонкаСсылки, Новый ОписаниеТипов("СправочникСсылка.SUI_НастройкиДокументов"));
		КолонкаСсылкиДобавлена = Истина;
	КонецЕсли;
	
	НайденнаяКолонка = КоллекцияНастроек.Колонки.Найти(КолонкаДанных);
	Если НайденнаяКолонка <> Неопределено Тогда
		КоллекцияНастроек.Колонки.Удалить(НайденнаяКолонка);
	КонецЕсли;
	КоллекцияНастроек.Колонки.Добавить(КолонкаДанных, Новый ОписаниеТипов("Структура"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", КоллекцияНастроек.ВыгрузитьКолонку(КолонкаСсылки));
	Запрос.УстановитьПараметр("ОтборПоСсылкам", 
		Не КолонкаСсылкиДобавлена И Запрос.Параметры.Ссылки.Количество());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ОтборПоСсылкам
		|			ТОГДА Ссылка В (&Ссылки)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		МетаданныеОбъекта = Метаданные.Справочники.SUI_НастройкиДокументов;
		
		РеквизитыХранилищаЗначений = Новый Массив();
		ТабличныеЧасти = Новый Массив();
		
		Для Каждого МетаданныеРеквизита Из МетаданныеОбъекта.Реквизиты Цикл
			
			Если МетаданныеРеквизита.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
				РеквизитыХранилищаЗначений.Добавить(МетаданныеРеквизита.Имя);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого МетаданныеТабличнойЧасти Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			ТабличныеЧасти.Добавить(МетаданныеТабличнойЧасти.Имя);
		КонецЦикла;
		
		ИсключаемыеКлючиЗаполнения = Новый Массив();
		SUI_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеКлючиЗаполнения, РеквизитыХранилищаЗначений);
		SUI_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеКлючиЗаполнения, ТабличныеЧасти);
		КлючиЗаполнения = SUI_ОбщегоНазначения.КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса, , 
			СтрСоединить(ИсключаемыеКлючиЗаполнения, ","));
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДанныеНастройки = Новый Структура(КлючиЗаполнения);
			ЗаполнитьЗначенияСвойств(ДанныеНастройки, Выборка);
			
			Для индекс = 0 По РеквизитыХранилищаЗначений.ВГраница() Цикл
				ДанныеНастройки.Вставить(РеквизитыХранилищаЗначений[индекс],
					Выборка[РеквизитыХранилищаЗначений[индекс]].Получить());
			КонецЦикла;
			
			Для индекс = 0 По ТабличныеЧасти.ВГраница() Цикл
				ДанныеНастройки.Вставить(ТабличныеЧасти[индекс],
					Выборка[ТабличныеЧасти[индекс]].Выгрузить());
			КонецЦикла;
			
			ПараметрыПоиска = Новый Структура();
			ПараметрыПоиска.Вставить(КолонкаСсылки, Выборка.Ссылка);
			НайденныеСтроки = КоллекцияНастроек.НайтиСтроки(ПараметрыПоиска);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				НайденныеСтроки.Добавить(КоллекцияНастроек.Добавить());
			КонецЕсли;
			
			Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
				НайденныеСтроки[индекс][КолонкаСсылки] = Выборка.Ссылка;
				НайденныеСтроки[индекс][КолонкаДанных] = ДанныеНастройки;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия(ВложенноеСобытие = "")
	Возврат НСтр("ru = 'Настройки документов'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

// Получить внешнее имя реквизита.
// 
// Параметры:
//  ИмяРеквизита - Строка - Имя реквизита
// 
// Возвращаемое значение:
//  Строка - Внешнее имя реквизита
Функция ПолучитьВнешнееИмяРеквизита(ИмяРеквизита)
	
	Если НРег(ИмяРеквизита) = "контрагент" Тогда
		Возврат "id_countragents";
	ИначеЕсли НРег(ИмяРеквизита) = "склад" Тогда
		Возврат "id_warehouse";
	ИначеЕсли НРег(ИмяРеквизита) = "номенклатура" Тогда
		Возврат "id_good";
	ИначеЕсли НРег(ИмяРеквизита) = "характеристика" Тогда
		Возврат "id_properties";
	ИначеЕсли НРег(ИмяРеквизита) = "серия" Тогда
		Возврат "id_series";
	ИначеЕсли НРег(ИмяРеквизита) = "упаковка" Тогда
		Возврат "id_unit";
	ИначеЕсли НРег(ИмяРеквизита) = "ячейка" Тогда
		Возврат "id_cell";
	ИначеЕсли НРег(ИмяРеквизита) = "видцены" Тогда
		Возврат "id_price";
	ИначеЕсли НРег(ИмяРеквизита) = "цена" Тогда
		Возврат "price";
	ИначеЕсли НРег(ИмяРеквизита) = "штрихкодупаковки" Тогда
		Возврат "id_marking_code";
	ИначеЕсли НРег(ИмяРеквизита) = "значениештрихкода" Тогда
		Возврат "mark_code";
	ИначеЕсли НРег(ИмяРеквизита) = "количествоплан" Тогда
		Возврат "qtty_plan";
	ИначеЕсли НРег(ИмяРеквизита) = "количествофакт" Тогда
		Возврат "qtty";
	ИначеЕсли НРег(ИмяРеквизита) = "номер" Тогда
		Возврат "doc_n";
	ИначеЕсли НРег(ИмяРеквизита) = "дата" Тогда
		Возврат "doc_date";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция СформироватьНастройкиРеквизитовДокумента(СтруктураНастройкиДокумента, СоответствияРеквизитов, ДокументСсылка, ИспользоватьОтбор = Истина)
	
	НастройкаРеквизитов = Неопределено;
	
	СхемаКомпоновки = СформироватьСхемуКомпоновкиДанных(ДокументСсылка);
	
	Если СхемаКомпоновки = Неопределено Тогда
		Возврат НастройкаРеквизитов;
	КонецЕсли;
	
	Реквизиты = Новый Соответствие();
	
	Реквизиты.Вставить(ПолучитьВнешнееИмяРеквизита("Номер"), Новый Структура("Имя,Тип", "Номер", Новый ОписаниеТипов("Строка")));
	Реквизиты.Вставить(ПолучитьВнешнееИмяРеквизита("Дата"), Новый Структура("Имя,Тип", "Дата", Новый ОписаниеТипов("Дата")));
	
	Для Каждого СоответствиеРеквизита Из СоответствияРеквизитов Цикл

		МетаданныеРеквизита = СтруктураНастройкиДокумента.Метаданные.Реквизиты.Найти(СоответствиеРеквизита.Значение);

		Если МетаданныеРеквизита = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Реквизиты.Вставить(ПолучитьВнешнееИмяРеквизита(СоответствиеРеквизита.Ключ), 
			Новый Структура("Имя,Тип", СоответствиеРеквизита.Значение, МетаданныеРеквизита.Тип));

	КонецЦикла;
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных();
	
	SUI_КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(НастройкиКомпоновки, 
		СтруктураНастройкиДокумента.НастройкиСхемыКомпоновкиДанных);
	
	Для Каждого Реквизит Из Реквизиты Цикл
		
		ПутьКДаннымПоля = Реквизит.Значение.Имя;

		Если SUI_КомпоновкаДанныхКлиентСервер.ПолеИспользуется(НастройкиКомпоновки, ПутьКДаннымПоля) Тогда
			
			ПользовательскоеПоле = НастройкиКомпоновки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыборКомпоновкиДанных"));
			ПользовательскоеПоле.Заголовок = Реквизит.Ключ;
			
			ВариантПользовательскогоПоля = ПользовательскоеПоле.Варианты.Элементы.Добавить();
			ВариантПользовательскогоПоля.Значение = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
			
			ПутьКДаннымПоля = ПользовательскоеПоле.ПутьКДанным;

		КонецЕсли;
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки, ПутьКДаннымПоля, Реквизит.Ключ);
		
	КонецЦикла;

	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, СхемаКомпоновки, 
		НастройкиКомпоновки, СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Если Не ИспользоватьОтбор Тогда 
		НастройкиКомпоновки.Отбор.Элементы.Очистить();	
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Для Каждого ПолеВыбора Из НастройкиКомпоновки.Выбор.Элементы Цикл
		
		Если Не ПолеВыбора.Использование Тогда
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), УровеньЖурналаРегистрации.Предупреждение, , , 
				СтрШаблон(НСтр("ru = 'Установлена некорректная настройка реквизитов для настройки документов ""%1""'"), 
				СтруктураНастройкиДокумента.Ссылка));
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьОшибки Тогда
		
		SUI_КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновки.НастройкиПоУмолчанию, 
			НастройкиКомпоновки);
		
		// Тестирование документа на соответствие отбору
		ПараметрыСКД = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных(СхемаКомпоновки);
		РезультатСКД = SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыСКД);
		
		Если РезультатСКД.Количество() = 0 Тогда
			Возврат НастройкаРеквизитов;
		КонецЕсли;
		
		НастройкаРеквизитов = Новый Структура();
		
		НастройкаРеквизитов.Вставить("Элементы", Реквизиты);
		НастройкаРеквизитов.Вставить("СхемаКомпоновкиДанных", СхемаКомпоновки);
	
		СтруктураНастройкиДокумента.Вставить("Реквизиты", НастройкаРеквизитов);
		
	КонецЕсли;

	Возврат НастройкаРеквизитов;

КонецФункции

Функция СформироватьНастройкиТабличныхЧастейДокумента(СтруктураНастройкиДокумента, СоответствияРеквизитовТабличныхЧастей, ДокументСсылка)

	НастройкиТабличныхЧастей = Новый Соответствие();
	
	СоответствияТабличныхЧастей = СоответствияРеквизитовТабличныхЧастей.Скопировать();

	СоответствияТабличныхЧастей.Свернуть("ТипТаблицы,ИмяТабличнойЧасти");
	
	Для Каждого СоответствиеТабличнойЧасти Из СоответствияТабличныхЧастей Цикл
		
		НастройкаТабличнойЧасти = Новый Структура("ТипТаблицы, ИмяТабличнойЧасти");
		
		ЗаполнитьЗначенияСвойств(НастройкаТабличнойЧасти, СоответствиеТабличнойЧасти);
		
		Если Не ЗначениеЗаполнено(НастройкаТабличнойЧасти.ТипТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеРеквизитовТабличнойЧасти = СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(НастройкаТабличнойЧасти);
		
		Если СоответствиеРеквизитовТабличнойЧасти.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкаТабличнойЧасти.Вставить("Метаданные", 
			СтруктураНастройкиДокумента.Метаданные.ТабличныеЧасти.Найти(НастройкаТабличнойЧасти.ИмяТабличнойЧасти));
		
		Если НастройкаТабличнойЧасти.Метаданные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкаТабличнойЧасти.Вставить("Элементы", Новый Соответствие());
		НастройкаТабличнойЧасти.Вставить("ОтсутствующиеРеквизиты", Новый Массив());
		
		// Реквизиты выбора штрихкодов упаковок товаров из настроек метаданных
		РеквизитШтрихкодУпаковки = "";
		Если НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
			
			РеквизитыВыбораШтрихкодыУпаковокТоваров = SUI_НастройкиМетаданныхСервер.ПолучитьРеквизитыВыбораИзНастройки(
				Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
				
			Если РеквизитыВыбораШтрихкодыУпаковокТоваров = Неопределено Тогда
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), УровеньЖурналаРегистрации.Предупреждение, , , 
					НСтр("ru = 'Отсутствует настройка метаданных штрихкодов упаковок.'"));
				Продолжить;
			КонецЕсли;

			МетаданныеШтрихкодаУпаковки = Метаданные.НайтиПоПолномуИмени(РеквизитыВыбораШтрихкодыУпаковокТоваров.ПолноеИмяОбъекта);
			
			РеквизитыВыбораШтрихкодыУпаковокТоваров = РеквизитыВыбораШтрихкодыУпаковокТоваров.Элементы;
			
			ОбязательныеРеквизитыШтрихкодыУпаковокТоваров = SUI_НастройкиМетаданныхКлиентСервер.ПолучитьОбязательныеРеквизиты("ШтрихкодыУпаковокТоваров");
			
			Для Каждого ОбязательныйРеквизитШтрихкодыУпаковокТоваров Из ОбязательныеРеквизитыШтрихкодыУпаковокТоваров Цикл

				Если Не РеквизитыВыбораШтрихкодыУпаковокТоваров.Свойство(ОбязательныйРеквизитШтрихкодыУпаковокТоваров) Тогда
					НастройкаТабличнойЧасти.ОтсутствующиеРеквизиты.Добавить(ОбязательныйРеквизитШтрихкодыУпаковокТоваров);
				Иначе
					Если ОбязательныйРеквизитШтрихкодыУпаковокТоваров = SUI_НастройкиМетаданныхКлиентСервер.ВнешнееИмяРеквизита("ШтрихкодыУпаковокТоваров", "Ссылка") Тогда
						РеквизитыВыбораШтрихкодыУпаковокТоваров.Удалить(ОбязательныйРеквизитШтрихкодыУпаковокТоваров);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЕстьОшибки = Ложь;
		
		Для Каждого СоответствиеРеквизита Из СоответствиеРеквизитовТабличнойЧасти Цикл
			
			ВнешнееИмяРеквизита = ПолучитьВнешнееИмяРеквизита(СоответствиеРеквизита.Ключ);
			
			Если ЗначениеЗаполнено(СоответствиеРеквизита.Значение) Тогда
				МетаданныеРеквизита = НастройкаТабличнойЧасти.Метаданные.Реквизиты.Найти(СоответствиеРеквизита.Значение);
			Иначе
				
				Если (ВнешнееИмяРеквизита = "id_good" Или ВнешнееИмяРеквизита = "qtty_plan" Или ВнешнееИмяРеквизита = "qtty") И
					(НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
					НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
					НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) Тогда
					ЕстьОшибки = Истина;
					Прервать;
				КонецЕсли;
				
				Если ВнешнееИмяРеквизита = "id_cell" И
					(НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
					НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) Тогда
					ЕстьОшибки = Истина;
					Прервать;
				КонецЕсли;
				
				Если ВнешнееИмяРеквизита = "id_marking_code" И 
					НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
					ЕстьОшибки = Истина;
					Прервать;
				КонецЕсли;
				
				МетаданныеРеквизита = Неопределено;
				Продолжить;
				
			КонецЕсли;
			
			Если МетаданныеРеквизита = Неопределено Тогда
				НастройкаТабличнойЧасти.ОтсутствующиеРеквизиты.Добавить(ВнешнееИмяРеквизита); 
			Иначе
				
				Если ВнешнееИмяРеквизита = "id_marking_code" И 
					НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
					РеквизитШтрихкодУпаковки = СоответствиеРеквизита.Значение;
				КонецЕсли;
				
				НастройкаТабличнойЧасти.Элементы.Вставить(ВнешнееИмяРеквизита, 
					Новый Структура("Имя,Тип", СоответствиеРеквизита.Значение, МетаданныеРеквизита.Тип));
					
			КонецЕсли;
			
		КонецЦикла;

		Если ЕстьОшибки Тогда
			Продолжить;
		КонецЕсли;
		
		СхемаТЧ = СформироватьСхемуКомпоновкиДанных(ДокументСсылка);
		
		Если СхемаТЧ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаборДанныхДокумент = СхемаТЧ.НаборыДанных.Найти("НаборДанныхДокумент");
		
		Если НаборДанныхДокумент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаборДанныхТЧ = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(СхемаТЧ, , "НаборДанныхТабличнаяЧасть");
		
		НаборДанныхТЧ.Запрос = "ВЫБРАТЬ * ИЗ " + СтруктураНастройкиДокумента.Метаданные.ПолноеИмя() + "." + НастройкаТабличнойЧасти.ИмяТабличнойЧасти;

		SUI_КомпоновкаДанныхСервер.ДобавитьСвязьНаборовДанных(СхемаТЧ, НаборДанныхДокумент, НаборДанныхТЧ, "Ссылка", "Ссылка");
		
		НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных();
	
		SUI_КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(НастройкиКомпоновки, 
			СтруктураНастройкиДокумента.НастройкиСхемыКомпоновкиДанных);
		
		Для Каждого Реквизит Из НастройкаТабличнойЧасти.Элементы Цикл
			
			ПутьКДаннымПоля = Реквизит.Значение.Имя;

			Если SUI_КомпоновкаДанныхКлиентСервер.ПолеИспользуется(НастройкиКомпоновки, ПутьКДаннымПоля) Тогда
				
				ПользовательскоеПоле = НастройкиКомпоновки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыборКомпоновкиДанных"));
				ПользовательскоеПоле.Заголовок = Реквизит.Ключ;
				
				ВариантПользовательскогоПоля = ПользовательскоеПоле.Варианты.Элементы.Добавить();
				ВариантПользовательскогоПоля.Значение = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
				
				ПутьКДаннымПоля = ПользовательскоеПоле.ПутьКДанным;
	
			КонецЕсли;
			
			SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки, ПутьКДаннымПоля, Реквизит.Ключ);

		КонецЦикла;
		
		// Реквизиты выбора штрихкодов упаковок товаров из настроек метаданных
		Если НастройкаТабличнойЧасти.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок И
			ЗначениеЗаполнено(РеквизитШтрихкодУпаковки) Тогда
			
			Для Каждого РеквизитВыбораШтрихкодыУпаковокТоваров Из РеквизитыВыбораШтрихкодыУпаковокТоваров Цикл
				
				МетаданныеРеквизитаШтрихкодаУпаковки = МетаданныеШтрихкодаУпаковки.Реквизиты.Найти(РеквизитВыбораШтрихкодыУпаковокТоваров.Значение);
				
				Если МетаданныеРеквизитаШтрихкодаУпаковки <> Неопределено Тогда
					НастройкаТабличнойЧасти.Элементы.Вставить(РеквизитВыбораШтрихкодыУпаковокТоваров.Ключ, 
						Новый Структура("Имя,Тип", РеквизитВыбораШтрихкодыУпаковокТоваров.Значение, МетаданныеРеквизитаШтрихкодаУпаковки.Тип));
						
					SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки, 
						РеквизитШтрихкодУпаковки + "." + РеквизитВыбораШтрихкодыУпаковокТоваров.Значение, РеквизитВыбораШтрихкодыУпаковокТоваров.Ключ);
					
				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли;
		
		Если НастройкаТабличнойЧасти.ОтсутствующиеРеквизиты.Количество() > 0 Тогда
			
			ПользовательскоеПоле = НастройкиКомпоновки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыборКомпоновкиДанных"));
			ПользовательскоеПоле.Заголовок = "SUI_ОтсутствующийРеквизит";
			
			ВариантПользовательскогоПоля = ПользовательскоеПоле.Варианты.Элементы.Добавить();
			ВариантПользовательскогоПоля.Значение = Неопределено;
			
			Для Каждого ОтсутствующийРеквизит Из НастройкаТабличнойЧасти.ОтсутствующиеРеквизиты Цикл
				SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки, 
					ПользовательскоеПоле.ПутьКДанным, ОтсутствующийРеквизит);
			КонецЦикла;
			
		КонецЕсли;
	
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
		
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, СхемаТЧ, 
			НастройкиКомпоновки, СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		
		НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
		
		SUI_КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(СхемаТЧ.НастройкиПоУмолчанию, НастройкиКомпоновки);
		
		НастройкаТабличнойЧасти.Вставить("СхемаКомпоновкиДанных", СхемаТЧ);
		
		НастройкиТабличныхЧастей.Вставить(НастройкаТабличнойЧасти.ТипТаблицы, НастройкаТабличнойЧасти);
		
	КонецЦикла;
	
	Если НастройкиТабличныхЧастей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураНастройкиДокумента.Вставить("ТабличныеЧасти", НастройкиТабличныхЧастей);
	
	Возврат НастройкиТабличныхЧастей;

КонецФункции

#КонецОбласти

#КонецЕсли
